.planning/case_profiles/case_026_v64_couette_dicts/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// case_026 · Plane Couette channel · 2D · single hex block · 20k cells
//
// Geometry:
//   Channel gap height H = 0.01 m (single gap from bottom y=0 to top y=H)
//   Channel length    L = 0.5 m  (50·H · ≥3·L_entrance buffer for Re_h=66.7)
//   2D wedge thickness z = 0.001 m (empty patches z = 0 and z = 0.001)
//
// Coordinate origin: x=0 at inlet, y=0 at bottom wall, z=0 at back face.
// y ∈ [0, H] · top wall at y=+H (movingWall), bottom wall at y=0 (noSlip).
//
// Single block topology:
//   Block 1 (full channel): nx=500, ny=40, nz=1 = 20,000 cells
//
// Grading rationale:
//   x: 1 (uniform · Δx = 1e-3 m streamwise)
//   y: 1 (UNIFORM · Δy = 2.5e-4 m · NO grading)
//      Rationale: Couette u(y) = U_top·y/H has CONSTANT gradient du/dy=U_top/H
//      → wall refinement gives no benefit; uniform mesh is the natural choice.
//      This is the key mesh-design difference vs B68 Poiseuille (bilinear 3:1).
//   z: 1 (uniform single layer, empty patches → no flux)
//
// Re_h = 66.67 deep laminar · no y+ constraint (no turbulence model).
// 40 cells across gap is generous for a linear field (any ny ≥ 4 should suffice
// in principle; ny=40 chosen for parity with B68 Poiseuille y-resolution).
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    // z = 0 (back face)
    ( 0      0       0       )   // 0  bottom-back-left  (inlet · bottom wall)
    ( 0.5    0       0       )   // 1  bottom-back-right (outlet · bottom wall)
    ( 0.5    0.01    0       )   // 2  top-back-right    (outlet · top wall)
    ( 0      0.01    0       )   // 3  top-back-left     (inlet · top wall)
    // z = 0.001 (front face)
    ( 0      0       0.001   )   // 4  bottom-front-left
    ( 0.5    0       0.001   )   // 5  bottom-front-right
    ( 0.5    0.01    0.001   )   // 6  top-front-right
    ( 0      0.01    0.001   )   // 7  top-front-left
);

blocks
(
    // Block 1: full channel · x ∈ [0, 0.5], y ∈ [0, +0.01], z ∈ [0, 0.001]
    // x grading 1: uniform Δx = 1e-3 m
    // y grading 1: uniform Δy = 2.5e-4 m (NO refinement · linear profile)
    // z grading 1: single layer (empty 2D)
    hex (0 1 2 3 4 5 6 7) (500 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
