.planning/case_profiles/case_026_v64_couette_dicts/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// case_026 · simpleFoam steady laminar · 5000-iter cap · plane Couette
// function objects: wallShearStress (τ_w), solverInfo (residuals)
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         5000;

deltaT          1;

writeControl    timeStep;
writeInterval   500;

purgeWrite      2;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    // Wall shear stress (kinematic m²/s²) on both walls — τ_w extraction
    // Analytical: τ_w,kin = ν·U_top/H = 1.5e-5·0.1/0.01 = 1.5e-5 m²/s² (constant)
    // Same at both walls since du/dy is constant throughout · pure-shear canonical.
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    onEnd;
        writeFields     true;
        log             true;
        patches         (bottomWall topWall);
    }

    // Residual extraction for convergence verification
    // Laminar fields: p, U (vector → Ux Uy split internally by solverInfo)
    residuals1
    {
        type            solverInfo;
        libs            (utilityFunctionObjects);
        fields          (p U);
        writeResidualFields false;
        writeControl    timeStep;
        writeInterval   1;
    }
}

// ************************************************************************* //
