.planning/case_profiles/case_026_v64_couette_dicts/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// p: GAMG + GaussSeidel · U: PBiCGStab + DILU
// URF: p=0.30, U=0.70 (NASA TMR canonical set · same as B68 Poiseuille)
// residualControl 1e-8 (strict FULL gate · laminar achievable; for Couette where
// dp/dx ≡ 0 and the linear field is exactly representable by 2nd-order, residuals
// should easily reach machine-precision floor 1e-12 or below)
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0.01;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 50;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-8;
        U               1e-8;
    }
}

relaxationFactors
{
    fields
    {
        p               0.30;
    }
    equations
    {
        U               0.70;
    }
}

// ************************************************************************* //
